## 车系数据来源，需要手工维护
## https://www.gac-toyota.com.cn/js/newprovincecitydealer/data/modleData.js
VEHICLE_DATA_SERIES = [
    {
        "value": "004036",
        "name": "全新换代雷凌",
        "car_code": "LEVIN",
        "sort": "1",
    },
    {
        "value": "004038",
        "name": "全新换代雷凌双擎",
        "car_code": "LEVHV",
        "sort": "2",
    },
    {
        "value": "004031",
        "name": "雷凌双擎E+",
        "car_code": "LEPHV",
        "sort": "3",
    },
    {
        "value": "004027",
        "name": "C-HR",
        "car_code": "C-HR",
        "sort": "4",
    },
    {
        "value": "004028",
        "name": "2018款全新汉兰达",
        "car_code": "HLD-T",
        "sort": "5",
    },
    {
        "value": "004033",
        "name": "2019款凯美瑞",
        "car_code": "CMY-8",
        "sort": "6",
    },
    {
        "value": "004034",
        "name": "2019款凯美瑞运动",
        "car_code": "CMY-8-SPORT",
        "sort": "7",
    },
    {
        "value": "004035",
        "name": "2019款凯美瑞双擎",
        "car_code": "CMY-8-DOUBLE",
        "sort": "8",
    },
    {
        "value": "004021",
        "name": "致享",
        "car_code": "YARLS-L",
        "sort": "9",
    },

    {
        "value": "004020",
        "name": "致炫",
        "car_code": "YRS-L",
        "sort": "10",
    },
    {
        "value": "004037",
        "name": "埃尔法双擎",
        "car_code": "ALPGARD",
        "sort": "11",
    },
    {
        "value": "004029",
        "name": "广汽ix4",
        "car_code": "ix4",
        "sort": "12",
    }
]

## 车版本编号
## https://www.gac-toyota.com.cn/js/newprovincecitydealer/data/seriesData.js

VEHICLE_DATA_VERSION = [
    {
        "value": "00403702",
        "name": "2.5L双擎豪华版",
        "parent": "004037"
    },
    {
        "value": "00403701",
        "name": "2.5L 双擎尊贵版",
        "parent": "004037"
    },
    {
        "value": "00402808",
        "name": "2.0T四驱至尊版",
        "parent": "004028"
    },
    {
        "value": "00402807",
        "name": "2.0T四驱尊贵版",
        "parent": "004028"
    },
    {
        "value": "00402806",
        "name": "2.0T四驱豪华版",
        "parent": "004028"
    },
    {
        "value": "00402805",
        "name": "2.0T四驱精英版",
        "parent": "004028"
    },
    {
        "value": "00402804",
        "name": "2.0T两驱尊贵版",
        "parent": "004028"
    },
    {
        "value": "00402803",
        "name": "2.0T两驱豪华版",
        "parent": "004028"
    },
    {
        "value": "00402802",
        "name": "2.0T两驱精英版",
        "parent": "004028"
    },
    {
        "value": "00402801",
        "name": "2.0T两驱精英版（五座）",
        "parent": "004028"
    },
    {
        "value": "00402715",
        "name": "酷跑领先天窗版",
        "parent": "004027"
    },
    {
        "value": "00402714",
        "name": "酷越领先天窗版",
        "parent": "004027"
    },
    {
        "value": "00402713",
        "name": "领先天窗版",
        "parent": "004027"
    },
    {
        "value": "00402712",
        "name": "豪华天窗版",
        "parent": "004027"
    },
    {
        "value": "00402711",
        "name": "旗舰天窗版",
        "parent": "004027"
    },
    {
        "value": "00402708",
        "name": "精英版",
        "parent": "004027"
    },
    {
        "value": "00402707",
        "name": "领先版",
        "parent": "004027"
    },
    {
        "value": "00403502",
        "name": "2.5HQ旗舰版",
        "parent": "004035"
    },
    {
        "value": "00403501",
        "name": "2.5HG豪华版",
        "parent": "004035"
    },
    {
        "value": "00403503",
        "name": "2.5HS锋尚版",
        "parent": "004035"
    },
    {
        "value": "00403402",
        "name": "2.5S锋尚版",
        "parent": "004034"
    },
    {
        "value": "00403401",
        "name": "2.0S锋尚版",
        "parent": "004034"
    },
    {
        "value": "00403305",
        "name": "2.5Q旗舰版",
        "parent": "004033"
    },
    {
        "value": "00403304",
        "name": "2.5G豪华版",
        "parent": "004033"
    },
    {
        "value": "00403303",
        "name": "2.0G豪华版",
        "parent": "004033"
    },
    {
        "value": "00403302",
        "name": "2.0E领先版",
        "parent": "004033"
    },
    {
        "value": "00403301",
        "name": "2.0E精英版",
        "parent": "004033"
    },
    {
        "value": "00402305",
        "name": "1.8HGS-V尊贵版",
        "parent": "004023"
    },
    {
        "value": "00402304",
        "name": "1.8HV豪华版(E-CVT)",
        "parent": "004023"
    },
    {
        "value": "00402303",
        "name": "1.8HGS-L领先版(E-CVT)",
        "parent": "004023"
    },
    {
        "value": "00402302",
        "name": "1.8HGS精英天窗版(E-CVT)",
        "parent": "004023"
    },
    {
        "value": "00402301",
        "name": "1.8HGS精英版(E-CVT)",
        "parent": "004023"
    },
    {
        "value": "00402210",
        "name": "185TG-V尊贵版(CVT)",
        "parent": "004022"
    },
    {
        "value": "00402208",
        "name": "1.8V豪华版(CVT)",
        "parent": "004022"
    },
    {
        "value": "00402207",
        "name": "1.8GS-L领先版(CVT)",
        "parent": "004022"
    },
    {
        "value": "00402206",
        "name": "1.8GS精英版(CVT)",
        "parent": "004022"
    },
    {
        "value": "00402205",
        "name": "185T领先版(CVT)",
        "parent": "004022"
    },
    {
        "value": "00402204",
        "name": "185T精英版(CVT)",
        "parent": "004022"
    },
    {
        "value": "00402203",
        "name": "185T精英版(MT)",
        "parent": "004022"
    },
    {
        "value": "00402202",
        "name": "185T新锐版(CVT)",
        "parent": "004022"
    },
    {
        "value": "00402201",
        "name": "185T新锐版(MT)",
        "parent": "004022"
    },
    {
        "value": "00402109",
        "name": "1.5GS锐动版(CVT)",
        "parent": "004021"
    },
    {
        "value": "00402108",
        "name": "1.5G炫动天窗版(CVT)",
        "parent": "004021"
    },
    {
        "value": "00402107",
        "name": "1.5G炫动版(CVT)",
        "parent": "004021"
    },
    {
        "value": "00402106",
        "name": "1.5G炫动版(MT)",
        "parent": "004021"
    },
    {
        "value": "00402105",
        "name": "1.5E魅动版(CVT)",
        "parent": "004021"
    },
    {
        "value": "00402104",
        "name": "1.5E魅动版(MT)",
        "parent": "004021"
    },
    {
        "value": "00402103",
        "name": "1.3E魅动版(CVT)",
        "parent": "004021"
    },
    {
        "value": "00402102",
        "name": "1.3E魅动版(MT)",
        "parent": "004021"
    },
    {
        "value": "00402101",
        "name": "1.3灵动版(MT)",
        "parent": "004021"
    },
    {
        "value": "00402010",
        "name": "1.5G劲速天窗升级版(CVT)",
        "parent": "004020"
    },
    {
        "value": "00402009",
        "name": "1.5E劲速升级版(CVT)",
        "parent": "004020"
    },
    {
        "value": "00402008",
        "name": "1.5GS锐动版(CVT)",
        "parent": "004020"
    },
    {
        "value": "00402007",
        "name": "1.5G炫动天窗版(CVT)",
        "parent": "004020"
    },
    {
        "value": "00402006",
        "name": "1.5G炫动版(CVT)",
        "parent": "004020"
    },
    {
        "value": "00402005",
        "name": "1.5G炫动版(MT)",
        "parent": "004020"
    },
    {
        "value": "00402004",
        "name": "1.5E魅动版(CVT)",
        "parent": "004020"
    },
    {
        "value": "00402003",
        "name": "1.3E魅动版(CVT)",
        "parent": "004020"
    },
    {
        "value": "00402002",
        "name": "1.3E魅动版(MT)",
        "parent": "004020"
    },
    {
        "value": "00402001",
        "name": "1.3灵动版(MT)",
        "parent": "004020"
    },
    {
        "value": "00400637",
        "name": "3.5L尊贵版",
        "parent": "004006"
    },
    {
        "value": "00400636",
        "name": "3.5L豪华版",
        "parent": "004006"
    },
    {
        "value": "00402901",
        "name": "领先版",
        "parent": "004029"
    },
    {
        "value": "00402902",
        "name": "豪华版",
        "parent": "004029"
    }
    ,
    {
        "value": "00403104",
        "name": "1.8PH V　豪华版",
        "parent": "004031"
    }
    ,
    {
        "value": "00403103",
        "name": "1.8PH GS　精英天窗版",
        "parent": "004031"
    }
    ,
    {
        "value": "00403102",
        "name": "1.8PH GS　精英风尚版",
        "parent": "004031"
    },
    {
        "value": "00403101",
        "name": "1.8PH GS　精英版",
        "parent": "004031"
    },
    {
        "value": "00403601",
        "name": "185T 进取版",
        "parent": "004036"
    }
    ,
    {
        "value": "00403602",
        "name": "185T 豪华版",
        "parent": "004036"
    },
    {
        "value": "00403603",
        "name": "185T 运动版",
        "parent": "004036"
    }
    ,
    {
        "value": "00403604",
        "name": "185T 科技版",
        "parent": "004036"
    }
    ,
    {
        "value": "00403605",
        "name": "185T 尊享版",
        "parent": "004036"
    },
    {
        "value": "00403801",
        "name": "双擎进取版",
        "parent": "004038"
    }
    ,
    {
        "value": "00403802",
        "name": "双擎豪华版",
        "parent": "004038"
    },
    {
        "value": "00403803",
        "name": "双擎运动版",
        "parent": "004038"
    }
    ,
    {
        "value": "00403804",
        "name": "双擎科技版",
        "parent": "004038"
    }
    ,
    {
        "value": "00403805",
        "name": "双擎尊享版",
        "parent": "004038"
    }
]

# // 雷凌、雷凌双擎
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2019/newLevinTable?module=jpb
# // https://www.gac-toyota.com.cn/minisite/campaigns/2019/newLevinTables/js/hevmap.js
VEHICLE_LL_CONFIG = {
    "": {
        "官方指导价": ["11.58万元", "12.98万元", "13.38万元", "13.98万元", "14.18万元", "13.38万元", "14.28万元", "14.68万元", "15.08万元", "15.28万元"]
    },
    "基本项目": {
        "长×宽×高（mm）": ["4640 × 1780× 1455", "4640 × 1780× 1455", "4640 ×1780×1435", "4640 × 1780× 1455", "4640 × 1780× 1455", "4640 × 1780× 1455", "4640 × 1780× 1455", "4640 × 1780× 1455", "4640 × 1780× 1455", "4640 × 1780× 1455"],
        "轴距（mm）": ["2700", "2700", "2700", "2700", "2700", "2700", "2700", "2700", "2700", "2700"],
        "前/后轮距（mm）": ["1527/1526", "1527/1526", "1531/1535", "1527/1526", "1527/1526", "1527/1526", "1527/1526", "1531/1535", "1527/1526", "1527/1526"],
        "整备质量（kg）": ["1,350", "1,360", "1,370", "1,370", "1,370", "1,410", "1,420", "1,430", "1,430", "1,430"],
        "综合工况油耗（L/100km）（国5/国6）": ["5.5/5.6", "5.5/5.6", "5.6/5.7", "5.5/5.6", "5.5/5.6", "4.1", "4.1", "4.2", "4.1", "4.1"],
        "Stop & Start System智能节油启停系统": ["●", "●", "●", "●", "●", "-", "-", "-", "-", "-"],
        "油箱容积": ["50L", "50L", "50L", "50L", "50L", "43L", "43L", "43L", "43L", "43L"]
    },
    "动力系统": {
        "型式": ["D-4T双循环直喷涡轮增压发动机/直列四缸/16气门-DOHC顶置双凸轮轴/VVT-iW智能广角可变气门正时进气系统", "D-4T双循环直喷涡轮增压发动机/直列四缸/16气门-DOHC顶置双凸轮轴/VVT-iW智能广角可变气门正时进气系统", "D-4T双循环直喷涡轮增压发动机/直列四缸/16气门-DOHC顶置双凸轮轴/VVT-iW智能广角可变气门正时进气系统",
               "D-4T双循环直喷涡轮增压发动机/直列四缸/16气门-DOHC顶置双凸轮轴/VVT-iW智能广角可变气门正时进气系统", "D-4T双循环直喷涡轮增压发动机/直列四缸/16气门-DOHC顶置双凸轮轴/VVT-iW智能广角可变气门正时进气系统", "直列四缸/16气门-DOHC顶置双凸轮轴/VVT-i/阿特金森循环", "直列四缸/16气门-DOHC顶置双凸轮轴/VVT-i/阿特金森循环",
               "直列四缸/16气门-DOHC顶置双凸轮轴/VVT-i/阿特金森循环", "直列四缸/16气门-DOHC顶置双凸轮轴/VVT-i/阿特金森循环", "直列四缸/16气门-DOHC顶置双凸轮轴/VVT-i/阿特金森循环"],
        "排气量（mL）": ["1197", "1197", "1197", "1197", "1197", "1798", "1798", "1798", "1798", "1798"],
        "最大功率（kW/rpm）": ["85/5200~5600", "85/5200~5600", "85/5200~5600", "85/5200~5600", "85/5200~5600", "72/5200", "72/5200", "72/5200", "72/5200", "72/5200"],
        "最大扭矩（Nm/rpm）": ["185/1500~4000", "185/1500~4000", "185/1500~4000", "185/1500~4000", "185/1500~4000", "142/3600", "142/3600", "142/3600", "142/3600", "142/3600"],
        "变速箱型式": ["S-CVT手自一体模拟10速", "S-CVT手自一体模拟10速", "S-CVT手自一体模拟10速", "S-CVT手自一体模拟10速", "S-CVT手自一体模拟10速", "E-CVT电子无级变速系统", "E-CVT电子无级变速系统", "E-CVT电子无级变速系统", "E-CVT电子无级变速系统", "E-CVT电子无级变速系统"]
    },
    "双擎动力系统": {
        "电动机峰值功率（kW）": ["-", "-", "-", "-", "-", "53", "53", "53", "53", "53"],
        "电动机峰值扭矩（Nm）": ["-", "-", "-", "-", "-", "163", "163", "163", "163", "163"],
        "系统最大输出功率（kW）": ["-", "-", "-", "-", "-", "90", "90", "90", "90", "90"]
    },
    "悬架·制动·驱动方式": {
        "前后悬架系统": ["前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架",
                   "前 : 麦弗逊式悬架 后: 双叉臂独立悬架", "前 : 麦弗逊式悬架 后: 双叉臂独立悬架"],
        "转向助力系统": ["EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统"],
        "前后制动系统": ["通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹"],
        "驱动方式": ["前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱"],
        "运动驾驶模式": ["●", "●", "●", "●", "●", "-", "-", "-", "-", "-"],
        "EV/ECO/POWER驾驶模式": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"]
    },
    "外观": {
        "电动天窗（带防夹功能）": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "切削式动感铝合金轮毂": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "轮胎尺寸": ["205/55 R16", "205/55 R16", "225/45 R17", "205/55 R16", "205/55 R16", "205/55 R16", "205/55 R16", "225/45 R17", "205/55 R16", "205/55 R16"],
        "LED大灯": ["●", "●", "●带透镜", "●", "●", "●", "●", "●带透镜", "●", "●"],
        "光感式智能前大灯系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED日间行车灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED示廓灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED前雾灯": ["-", "-", "●", "●", "●", "-", "-", "●", "●", "●"],
        "LED组合尾灯": ["●", "●", "●", "●", "●", "●光带式", "●光带式", "●光带式", "●光带式", "●光带式"],
        "带镀铬饰条下进气格栅": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "车底空气动力学导流板": ["●前部", "●前后", "●前后", "●前后", "●前后", "●前部", "●前后", "●前后", "●前后", "●前后"],
        "侧窗框镀铬": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"]
    },
    "内饰": {
        "彩色TFT多功能信息显示屏": ["-", "●4.2英寸", "●4.2英寸", "●7英寸", "●4.2英寸", "●4.2英寸", "●4.2英寸", "●4.2英寸", "●7英寸", "●4.2英寸"],
        "集成控制式多功能方向盘": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "方向盘四向调节": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "真皮方向盘/换挡杆": ["-", "-", "-", "-", "●", "-", "-", "-", "-", "●"],
        "车内前后排阅读灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "Levin专属地毯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "座椅": {
        "高级织物座椅": ["●", "●", "●", "●", "-", "●", "●", "●", "●", "-"],
        "豪华真皮+合成皮座椅": ["-", "-", "-", "-", "●", "-", "-", "-", "-", "●"],
        "驾驶席6向手动调节": ["●", "●", "●", "●", "-", "●", "●", "●", "●", "-"],
        "驾驶席10向电动调节": ["-", "-", "-", "-", "●", "-", "-", "-", "-", "●"],
        "副驾驶席4向手动调节": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后排座椅6/4分割": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后排中央扶手": ["-", "-", "-", "-", "●", "-", "-", "-", "-", "●"],
        "后排3个头枕": ["●", "●", "●", "●", "●独立可调", "●", "●", "●", "●", "●独立可调"]
    },
    "Sporty版 专属个性设计": {
        "鹰眼立体LED大灯（远近光一体）": ["-", "-", "●", "-", "-", "-", "-", "●", "-", "-"],
        "17英寸劲酷双色铝合金轮毂": ["-", "-", "●", "-", "-", "-", "-", "●", "-", "-"],
        "运动风格专属设计座椅": ["-", "-", "●", "-", "-", "-", "-", "●", "-", "-"],
        "低趴姿势车身高": ["-", "-", "●", "-", "-", "-", "-", "-", "-", "-"]
    },
    "安全": {
        "驾驶席二级式正面SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "副驾驶席二级式正面SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "驾驶席膝部SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "副驾驶席坐垫SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排侧SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "侧窗帘式SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "防盗监控警报": ["-", "-", "●", "●", "●", "-", "-", "●", "●", "●"],
        "ABS防抱死制动系统（带 EBD电子制动力分配系统）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "VSC车身稳定控制系统（带ACA主动转向辅助系统）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "TRC牵引力控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "HAC坡路起步辅助控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "BA制动辅助系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "TPMS胎压监测系统": ["●", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示"],
        "倒车雷达": ["-", "-", "●", "●", "●", "-", "-", "●", "●", "●"],
        "倒车影像功能": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "ISOFIX儿童座椅固定装置": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "丰田纯正儿童座椅": ["○", "○", "○", "○", "○", "○", "○", "○", "○", "○"]
    },
    "最新Toyota Safety Sense智行安全（丰田规避碰撞辅助套装）": {
        "PCS预碰撞安全系统（带前方行人识别）": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "DRCC动态雷达巡航控制系统（带多种速度区间实现自适应巡航）": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "LTA车道循迹辅助系统": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "AHB自动调节远光灯系统": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"]
    },
    "舒适·便捷": {
        "EPB电子驻车系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "智能无钥匙进入系统": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "一键启动": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "四门车窗一键升降（带防夹功能）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后排双USB充电接口（2.1A）": ["-", "-", "-", "-", "●", "-", "-", "-", "-", "●"],
        "带滤清器空调（可对应PM2.5）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "智能双循环自动空调": ["-", "-", "-", "●", "●", "●", "●", "●", "●", "●"],
        "智能PM2.5过滤系统（带PM2.5状况显示）": ["-", "-", "-", "●", "●", "●", "●", "●", "●", "●"],
        "空调后排出风口": ["-", "-", "-", "-", "●", "-", "-", "-", "-", "●"]
    },
    "科技版三屏联动智能显示": {
        "10.8英寸彩色HUD平视显示系统": ["-", "-", "-", "●", "-", "-", "-", "-", "●", "-"],
        "7英寸彩色TFT多功能信息显示屏": ["-", "-", "-", "●", "-", "-", "-", "-", "●", "-"],
        "12.1英寸中控显示屏": ["-", "-", "-", "●", "-", "-", "-", "-", "●", "-"]
    },
    "丰云悦享·丰田智行互联*": {
        "被盗追踪（远程启动限制）": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "疏忽提醒": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "车辆防盗警报（APP）": ["-", "-", "●", "●", "●", "-", "-", "●", "●", "●"],
        "远程故障诊断服务": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "保养提醒": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "紧急救援/道路救援": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "APP车况查询/远程控制": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "在线实时交通路况显示": ["-", "-", "-", "●", "-", "-", "-", "-", "●", "-"],
        "云端语音识别": ["-", "-", "-", "●", "-", "-", "-", "-", "●", "-"]
    },
    "音响·娱乐·导航": {
        "AUX+USB音频接口": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "彩色中控触控显示屏（带BaiduCarLife/Welink手机互联系统）": ["-", "●9英寸", "●9英寸", "●12.1英寸", "●9英寸", "-", "●9英寸", "●9英寸", "●12.1英寸", "●9英寸"],
        "12.1英寸语音导航系统（带实时交通路况信息）": ["-", "-", "-", "●", "-", "-", "-", "-", "●", "-"],
        "车载蓝牙": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"]
    }
}
VEHICLE_LL_MODEL = ['185T 进取版', '185T 豪华版', '185T 运动版', '185T 科技版', '185T 尊享版', '双擎进取版', '双擎豪华版', '双擎运动版', '双擎科技版', '双擎尊享版']

# // 雷凌双擎E+
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2019/levinphevTable?module=18hh
# // https://www.gac-toyota.com.cn/minisite/campaigns/2019/levinphevtable/js/data.js

VEHICLE_LLE_CONFIG = {
    "": {
        "官方指导价": ["20.38万元", "20.98万元", "21.28万元", "21.88万元"]
    },
    "■尺寸": {
        "长 x 宽 x 高（mm）": ["4645 x 1775 x 1480", "4645 x 1775 x 1480", "4645 x 1775 x 1480", "4645 x 1775 x 1480"],
        "轴距（mm）": ["2700", "2700", "2700", "2700"],
        "前/后 轮距（mm）": ["1525/1520", "1525/1520", "1525/1520", "1525/1520"],
        "整备质量（kg）": ["1510", "1535", "1535", "1540"],
        "最小转弯半径（m）": ["5.4", "5.4", "5.4", "5.4"],
        "油箱容积（L）": ["40", "40", "40", "40"],
        "轮胎尺寸": ["205/55 R16", "205/55 R16", "205/55 R16", "205/55 R16"]
    },
    "■发动机": {
        "型式  ": ["8ZR-FXE", "8ZR-FXE", "8ZR-FXE", "8ZR-FXE"],
        "排气量（cc）": ["1798", "1798", "1798", "1798"],
        "最大功率（kW） ": ["73", "73", "73", "73"],
        "最大扭矩（Nm） ": ["142", "142", "142", "142"],
        "百公里综合工况油耗（L/100km）": ["1.3", "1.3", "1.3", "1.3"],
        "HEV模式下百公里综合油耗（L/100km）": ["4.3", "4.3", "4.3", "4.3"]
    },
    "■变速箱": {
        "变速箱型式": ["E-CVT电子无级变速系统", "E-CVT电子无级变速系统", "E-CVT电子无级变速系统", "E-CVT电子无级变速系统"]
    },
    "■电动机": {
        "型号": ["永磁同歩电机", "永磁同歩电机", "永磁同歩电机", "永磁同歩电机"],
        "最大功率（kW）  ": ["53", "53", "53", "53"],
        "最大扭矩（Nm）  ": ["207", "207", "207", "207"]
    },
    "■油电混合“双擎E+”动力系统": {
        "型式 ": ["混联式", "混联式", "混联式", "混联式"],
        "最大功率（kW）": ["100", "100", "100", "100"],
        "最大马力（PS）": ["136", "136", "136", "136"]
    },
    "■油电混合“双擎E+”动力系统专用电池": {
        "型式": ["锂离子电池", "锂离子电池", "锂离子电池", "锂离子电池"],
        "容量（kWh）": ["10.5", "10.5", "10.5", "10.5"],
        "纯电动续航里程（km）": ["55", "55", "55", "55"]
    },
    "■制动･悬挂･驱动方式": {
        "制动系统（前/后）": ["通风盘式/实心盘式", "通风盘式/实心盘式", "通风盘式/实心盘式", "通风盘式/实心盘式"],
        "悬挂系统（前/后）": ["麦弗逊式悬挂/扭力梁式悬挂", "麦弗逊式悬挂/扭力梁式悬挂", "麦弗逊式悬挂/扭力梁式悬挂", "麦弗逊式悬挂/扭力梁式悬挂"],
        "驱动方式": ["前置前驱", "前置前驱", "前置前驱", "前置前驱"]
    },
    "■外观": {
        "电动天窗": ["-", "●", "●", "●"],
        "铝合金轮毂": ["16英寸", "16英寸", "16英寸", "16英寸"],
        "LED大灯（带LEVIN PLUG-IN HYBRID字样标识）": ["●", "●", "●", "●"],
        "LED示廓灯": ["●", "●", "●", "●"],
        "前雾灯": ["●", "●", "●", "●"],
        "LED组合尾灯 ": ["●", "●", "●", "●"],
        "LED高位刹车灯": ["●", "●", "●", "●"],
        "前大灯自动水平控制系统": ["●", "●", "●", "●"],
        "鲨鱼鳍天线": ["●", "●", "●", "●"],
        "间歇式雨刮": ["●", "●", "●", "●"],
        "外后视镜带转向灯": ["●", "●", "●", "●"],
        "门外把手镀铬饰件": ["-", "-", "-", "●"],
        "专属高质感电镀黑铬套装（前格栅上装饰条、车门下方装饰条、车尾装饰条）": ["●", "●", "●", "●"]
    },
    "■内饰": {
        "4.2英寸TFT彩色多功能信息显示屏": ["●", "●", "●", "●"],
        "自动空调": ["●", "●", "●", "●"],
        "空调滤清器（可对应PM2.5）": ["●", "●", "●", "●"],
        "前后、上下可调节式方向盘": ["●树脂", "●树脂", "●树脂", "●真皮"],
        "多功能方向盘": ["●", "●", "●", "●"],
        "方向盘四向调节": ["●", "●", "●", "●"],
        "车厢迎宾照明系统": ["●", "●", "●", "●"],
        "LEVIN 专属地毯": ["●", "●", "●", "●"]
    },
    "■座椅": {
        "座椅材质": ["●织物", "●织物", "●织物", "●真皮※1"],
        "运动型座椅": ["-", "-", "-", "●"],
        "驾驶席6向手动调节": ["●", "●", "●", "●"],
        "副驾驶席4向手动调节": ["●", "●", "●", "●"],
        "后排中央扶手": ["●", "●", "●", "●"],
        "独立可调后排头枕（3个）": ["●", "●", "●", "●"]
    },
    "■安全配置": {
        "EPS电子助力转向系统": ["●", "●", "●", "●"],
        "ABS防抱死制动系统(带EBD电子制动力分配系统)": ["●", "●", "●", "●"],
        "BA制动辅助系统": ["●", "●", "●", "●"],
        "VSC车身稳定控制系统": ["●", "●", "●", "●"],
        "TRC牵引力控制系统": ["●", "●", "●", "●"],
        "HAC坡路起步辅助控制系统": ["●", "●", "●", "●"],
        "内置式TPMS胎压监测系统（带数值显示）": ["●", "●", "●", "●"],
        "前排SRS空气囊": ["●", "●", "●", "●"],
        "前排侧SRS空气囊": ["●", "●", "●", "●"],
        "窗帘式SRS空气囊": ["-", "●", "●", "●"],
        "倒车影像系统": ["-", "-", "●", "●"],

        "发动机锁止系统": ["●", "●", "●", "●"],

        "ISOFIX 儿童座椅固定装置": ["●", "●", "●", "●"],
        "丰田纯正儿童座椅": ["○", "○", "○", "○"]
    },
    "■操控/便利装备": {
        "一键启动系统": ["●", "●", "●", "●"],
        "智能无匙进入系统": ["-", "-", "-", "●"],
        "车灯熄火自动关闭系统": ["●", "●", "●", "●"],
        "定速巡航": ["-", "-", "-", "●"],
        "三种驾驶模式（ECO/NORMAL/POWER）": ["●", "●", "●", "●"],
        "车身扭矩缓振系统": ["●", "●", "●", "●"],
        "四门电动车窗": ["●带驾驶席一键升降功能", "●带驾驶席一键升降功能", "●带驾驶席一键升降功能", "●带驾驶席一键升降功能"],

    },
    "■娱乐系统": {
        "CD播放系统（带AM/FM/MP3/WMA播放功能）": ["●", "●", "-", "-"],
        "8英寸多点触控电容彩屏": ["-", "-", "●", "●"],
        "带百度Carlife的智能手机互联多媒体系统": ["-", "-", "●", "●"],
        "GPS导航系统": ["-", "-", "●", "●"],
        "车载蓝牙（带免提电话及音乐播放功能）": ["-", "-", "●", "●"],
        "AUX+USB多媒体接入端口": ["●", "●", "●", "●"],

    },
    "■PHEV专属": {
        "充电桩": ["●", "●", "●", "●"],
        "充电时间预约功能": ["●", "●", "●", "●"]
    }
}
VEHICLE_LLE_MODEL = ["1.8PH GS 精英版", "1.8PH GS 精英风尚版", "1.8PH GS 精英天窗版", "1.8PH V 豪华版"]

# // C-HR
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2018/CHRTable?model=qjbtc
# // https://www.gac-toyota.com.cn/minisite/campaigns/2018/C-HRTable/js/hevmap.js
VEHICLE_CHR_CONFIG = {
    "": {
        "官方指导价": ["17.88万元", "16.58万元", "15.18万元", "15.58万元", "14.18万元", "15.98万元", "15.98万元"]
    },
    "■基本项目": {
        "长Ⅹ宽Ⅹ高（mm）": ["4405Ⅹ1795Ⅹ1565", "4405Ⅹ1795Ⅹ1565", "4405Ⅹ1795Ⅹ1565", "4405Ⅹ1795Ⅹ1565", "4405Ⅹ1795Ⅹ1565", "4445Ⅹ1825Ⅹ1565", "4475Ⅹ1795Ⅹ1565"],
        "轴距（mm）": ["2640", "2640", "2640", "2640", "2640", "2640", "2640"],
        "轮距（mm）": ["前：1550    后：1550", "前：1550    后：1550", "前：1550    后：1550", "前：1550    后：1550", "前：1550    后：1550", "前：1550  后：1550", "前：1550  后：1550"],
        "整备质量（kg）": ["1510", "1510", "1505", "1505", "1490", "1505", "1505"],
        "综合工况油耗（L/100km）": ["5.7", "5.7", "5.7", "5.7", "5.7", "5.7", "5.7"],
        "油箱容积（L）": ["50", "50", "50", "50", "50", "50", "50"]
    },
    "■动力系统": {
        "发动机型式": ["直列四缸/16气门-DOHC顶置双凸轮轴\n智能可变气门正时电子控制系统：VVT-iE（进气侧）/ VVT-i （排气侧）", "直列四缸/16气门-DOHC顶置双凸轮轴\n智能可变气门正时电子控制系统：VVT-iE（进气侧）/ VVT-i （排气侧）", "直列四缸/16气门-DOHC顶置双凸轮轴\n智能可变气门正时电子控制系统：VVT-iE（进气侧）/ VVT-i （排气侧）",
                  "直列四缸/16气门-DOHC顶置双凸轮轴\n智能可变气门正时电子控制系统：VVT-iE（进气侧）/ VVT-i （排气侧）", "直列四缸/16气门-DOHC顶置双凸轮轴\n智能可变气门正时电子控制系统：VVT-iE（进气侧）/ VVT-i （排气侧）", "直列四缸/16气门-DOHC顶置双凸轮轴\n智能可变气门正时电子控制系统：VVT-iE（进气侧）/ VVT-i（排气侧）",
                  "直列四缸/16气门-DOHC顶置双凸轮轴\n智能可变气门正时电子控制系统：VVT-iE（进气侧）/ VVT-i（排气侧）"],
        "供油方式": ["EFI电子控制燃油喷射系统\nD-4S 双喷射供油系统", "EFI电子控制燃油喷射系统\nD-4S 双喷射供油系统", "EFI电子控制燃油喷射系统\nD-4S 双喷射供油系统", "EFI电子控制燃油喷射系统\nD-4S 双喷射供油系统", "EFI电子控制燃油喷射系统\nD-4S 双喷射供油系统", "EFI电子控制燃油喷射系统\nD-4S 双喷射供油系统", "EFI电子控制燃油喷射系统\nD-4S 双喷射供油系统"],
        "排量（mL）": ["1987", "1987", "1987", "1987", "1987", "1987", "1987"],
        "压缩比": ["13.0：1", "13.0：1", "13.0：1", "13.0：1", "13.0：1", "13.0：1", "13.0：1"],
        "最大功率（kW/rpm）": ["126/6600", "126/6600", "126/6600", "126/6600", "126/6600", "126/6600", "126/6600"],
        "最大扭矩（Nm/rpm）": ["203/4400~4800", "203/4400~4800", "203/4400~4800", "203/4400~4800", "203/4400~4800", "203/4400~4800", "203/4400~4800"],
        "最高车速（km/h）": ["185", "185", "185", "185", "185", "185", "185"],
        "变速系统": ["Direct Shift-CVT （模拟10速CVT变速箱）", "Direct Shift-CVT （模拟10速CVT变速箱）", "Direct Shift-CVT （模拟10速CVT变速箱）", "Direct Shift-CVT （模拟10速CVT变速箱）", "Direct Shift-CVT （模拟10速CVT变速箱）", "Direct Shift-CVT （模拟10速CVT变速箱）",
                 "Direct Shift-CVT （模拟10速CVT变速箱）"],
        "Stop&Start System 智能节油启停系统": ["●", "●", "●", "●", "●", "●", "●"],
        "环保标准": ["国Ⅴ/国Ⅵ", "国Ⅴ/国Ⅵ", "国Ⅴ/国Ⅵ", "国Ⅴ/国Ⅵ", "国Ⅴ/国Ⅵ", "国Ⅴ/国Ⅵ", "国Ⅴ/国Ⅵ"]
    },
    "■悬架、制动方式": {
        "前后悬架系统": ["前：麦弗逊式悬架   后：双叉臂式悬架", "前：麦弗逊式悬架   后：双叉臂式悬架", "前：麦弗逊式悬架   后：双叉臂式悬架", "前：麦弗逊式悬架   后：双叉臂式悬架", "前：麦弗逊式悬架   后：双叉臂式悬架", "前：麦弗逊式悬架    后：双叉臂式悬架", "前：麦弗逊式悬架    后：双叉臂式悬架"],
        "前后制动系统": ["前：通风盘式碟刹   后：实心盘式碟刹", "前：通风盘式碟刹   后：实心盘式碟刹", "前：通风盘式碟刹   后：实心盘式碟刹", "前：通风盘式碟刹   后：实心盘式碟刹", "前：通风盘式碟刹   后：实心盘式碟刹", "前：通风盘式碟刹    后：实心盘式碟刹", "前：通风盘式碟刹    后：实心盘式碟刹"],
        "转向助力系统": ["EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统"]
    },
    "■外观": {
        "电动天窗（带防夹功能）": ["●", "●", "—", "●", "—", "●", "●"],
        "轮胎尺寸": ["215/60 R17", "215/60 R17", "215/60 R17", "215/60 R17", "215/60 R17", "215/60 R17", "215/60 R17"],
        "切削轮毂": ["●", "●", "●", "●", "—", "●", "●"],
        "电动调节外后视镜": ["●（带加热功能）", "●", "●", "●", "●", "●", "●"],
        "鲨鱼鳍天线": ["●（带GPS功能）", "●（带GPS功能）", "●（带GPS功能）", "●（带GPS功能）", "●", "●（带GPS功能）", "●（带GPS功能）"],
        "双尾翼": ["●", "●", "●", "●", "●", "●", "●"],
        "前包围、后包围": ["—", "—", "—", "—", "—", "硬派越野造型、酷装重甲设计", "型格动感造型、速猛凌动设计"],
        "侧包围": ["—", "—", "—", "—", "—", "锋锐棱角侧裙", "犀利逸动侧裙"],
        "霸气酷感轮眉": ["—", "—", "—", "—", "—", "●", "—"],
        "双色车身": ["o", "o", "o", "o", "—", "—", "—"],
        "分割式后窗隐私玻璃、后挡风隐私玻璃": ["●", "●", "●", "●", "●", "●", "●"]
    },
    "■灯光": {
        "LED前大灯（带渐进式转向灯）": ["●", "●", "—", "—", "—", "—", "—"],
        "卤素前大灯": ["—", "—", "●", "●", "●", "●", "●"],
        "前雾灯": ["●", "●", "●", "●", "—", "●", "●"],
        "光感式智能前大灯系统": ["●", "●", "●", "●", "●", "●", "●"],
        "前大灯水平控制系统": ["●（自动）", "●（自动）", "●（手动）", "●（手动）", "●（手动）", "●（手动）", "●（手动）"],
        "LED日间行车灯": ["●", "●", "●", "●", "●", "●", "●"],
        "LED组合尾灯": ["●", "●", "—", "—", "—", "—", "—"],
        "LED高位刹车灯": ["●", "●", "●", "●", "●", "●", "●"]
    },
    "■内饰": {
        "内顶棚颜色": ["黑色 或 米色", "黑色 或 米色", "黑色 或 米色", "黑色 或 米色", "黑色 或 米色", "黑色 或 米色", "黑色 或 米色"],
        "9英寸全触控液晶大屏\n（智能语音控制导航系统）": ["●", "●", "●", "●", "—", "●", "●"],
        "4.2英寸彩色TFT多功能信息显示屏": ["●", "●", "●", "●", "●", "●", "●"],
        "多功能方向盘": ["●", "●", "●", "●", "●", "●", "●"],
        "方向盘4向调节（上下、前后）": ["●", "●", "●", "●", "●", "●", "●"],
        "真皮方向盘": ["●", "●", "—", "—", "—", "—", "—"],
        "真皮换挡杆": ["●", "●", "●", "●", "●", "●", "●"],
        "仪表台饰条": ["●", "●", "●", "●", "●", "●", "●"],
        "座椅材质": ["真皮+合成皮", "高级织物（双色）", "高级织物（双色）", "高级织物（双色）", "高级织物", "高级织物（双色）", "高级织物（双色）"],
        "前排座椅6向调节\n（前后滑动调节、垂直调节、靠背调节）": ["●", "●", "●", "●", "●", "●", "●"],
        "后排座椅4/6分割": ["●", "●", "●", "●", "●", "●", "●"]
    },
    "■安全": {
        "ABS防抱死制动系统": ["●", "●", "●", "●", "●", "●", "●"],
        "VSC车身稳定控制系统": ["●", "●", "●", "●", "●", "●", "●"],
        "TRC牵引力控制系统": ["●", "●", "●", "●", "●", "●", "●"],
        "HAC坡路起步辅助控制系统": ["●", "●", "●", "●", "●", "●", "●"],
        "BA制动辅助系统": ["●", "●", "●", "●", "●", "●", "●"],
        "EBD电子制动力分配系统": ["●", "●", "●", "●", "●", "●", "●"],
        "TPWS胎压监测系统": ["●", "●", "●", "●", "●", "●", "●"],
        "BSM并线盲点监测系统 ": ["●", "—", "—", "—", "—", "—", "—"],
        "RCTA倒车侧后方盲点警示系统": ["●", "—", "—", "—", "—", "—", "—"],
        "全方位泊车雷达（共8个探头）": ["●", "●", "—", "—", "—", "—", "—"],
        "倒车影像": ["●", "●", "●", "●", "—", "●", "●"],
        "驾驶席、副驾驶席正面SRS空气囊": ["●", "●", "●", "●", "●", "●", "●"],
        "驾驶席膝部SRS空气囊": ["●", "●", "●", "●", "●", "●", "●"],
        "副驾驶席座垫SRS空气囊": ["●", "●", "●", "●", "●", "●", "●"],
        "前排侧SRS空气囊": ["●", "●", "●", "●", "●", "●", "●"],
        "侧窗帘式SRS空气囊": ["●", "●", "●", "●", "●", "●", "●"],
        "后排侧SRS空气囊": ["●", "●", "●", "●", "●", "●", "●"],
        "防盗系统（带发动机锁止功能）": ["●", "●", "●", "●", "●", "●", "●"],
        "后挡风玻璃除雾": ["●", "●", "●", "●", "●", "●", "●"],
        "ISOFIX 儿童座椅固定装置": ["●", "●", "●", "●", "●", "●", "●"],
        "发动机下保护挡板": ["●", "●", "●", "●", "●", "●", "●"],
        "丰田纯正儿童座椅": ["o", "o", "o", "o", "o", "o", "o"]
    },
    "■Toyota Safety Sense 智行安全（丰田规避碰撞辅助套装）": {
        "PCS预碰撞安全系统": ["●", "●", "●", "●", "—", "●", "●"],
        "DRCC动态雷达巡航控制系统": ["●", "●", "●", "●", "—", "●", "●"],
        "LDA车道偏离警示系统\n（带方向盘回正功能）": ["●", "●", "●", "●", "—", "●", "●"],
        "AHB自动调节远光灯系统": ["●", "●", "●", "●", "—", "●", "●"]
    },
    "■舒适·便捷": {
        "运动驾驶模式": ["●", "●", "—", "—", "—", "—", "—"],
        "EPB电子驻车系统": ["●", "●", "●", "●", "●", "●", "●"],
        "智能钥匙、一键启动": ["●", "●", "●", "●", "—", "●", "●"],
        "触控式门锁（驾驶席、副驾驶席）": ["●", "●", "●", "●", "—", "●", "●"],
        "四门车窗一键升降": ["●", "●", "●", "●", "●", "●", "●"],
        "nanoe™纳米水离子发生器": ["●", "●", "—", "—", "—", "—", "—"],
        "左右双区独立全自动空调": ["●", "●", "—", "—", "—", "—", "—"],
        "手动空调": ["—", "—", "●", "●", "●", "●", "●"],
        "空调滤清器（可对应PM2.5）": ["●", "●", "●", "●", "●", "●", "●"],
        "车载蓝牙": ["●", "●", "●", "●", "—", "●", "●"],
        "音响系统": ["● 6扬声器", "● 6扬声器", "● 6扬声器", "● 6扬声器", "● 4扬声器", "● 6扬声器", "● 6扬声器"],
        "AUX+USB接口": ["●", "●", "●", "●", "●", "●", "●"]
    }
}
VEHICLE_CHR_MODEL = ["旗舰天窗版", "豪华天窗版", "领先版", "领先天窗版", "精英版", "酷越领先天窗版", "酷跑领先天窗版"]

# // 汉兰达
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2018/2018newhighlander/models?model=2.0fex
# // https://www.gac-toyota.com.cn/minisite/campaigns/2018/HighlanderMinisite/newHighlander/js/mdata.js

VEHICLE_HLD_CONFIG = {
    "": {
        "官方指导价": [
            "23.98万元",
            "24.88万元",
            "28.98万元",
            "29.98万元",
            "25.88万元",
            "29.98万元",
            "30.68万元",
            "32.58万元"
        ]
    },
    "基本项目": {
        "长×宽×高(mm)": ["4890×1925×1720", "4890×1925×1720", "4890×1925×1720", "4890×1925×1720", "4890×1925×1715", "4890×1925×1715", "4890×1925×1715", "4890×1925×1715"],
        "轴距(mm)": ["2790", "2790", "2790", "2790", "2790", "2790", "2790", "2790"],
        "前/后轮距(mm)": ["1635/1630", "1635/1630", "1635/1630", "1635/1630", "1635/1630", "1635/1630", "1635/1630", "1635/1630"],
        "最小转弯半径(m)": ["5.9", "5.9", "5.9", "5.9", "5.9", "5.9", "5.9", "5.9"],
        "整备质量(kg)": ["1900", "1925", "1990", "1990", "2000", "2070", "2070", "2070"],
        "综合工况油耗（L/100km）": ["8.2", "8.2", "8.3", "8.3", "8.6", "8.7", "8.7", "8.7"],
        "油箱容积(L)": ["72", "72", "72", "72", "72", "72", "72", "72"],
        "承载人数（人）": ["5", "7", "7", "7", "7", "7", "7", "7"]
    },
    "动力系统": {
        "发动机型号": ["8AR-FTS", "8AR-FTS", "8AR-FTS", "8AR-FTS", "8AR-FTS", "8AR-FTS", "8AR-FTS", "8AR-FTS"],
        "发动机型式": ["D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统", "D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统",
                  "D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统", "D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统",
                  "D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统", "D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统",
                  "D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统", "D-4ST（双涡管涡轮增压直喷发动机）\n直列4缸/16气门-DOHC(顶置双凸轮轴)\nVVT-iW智能广角可变气门正时进气系统\nVVT-i智能可变气门正时电子控制系统"],
        "供油方式": ["EFI（电子控制燃油喷射系统）", "EFI（电子控制燃油喷射系统）", "EFI（电子控制燃油喷射系统）", "EFI（电子控制燃油喷射系统）", "EFI（电子控制燃油喷射系统）", "EFI（电子控制燃油喷射系统）", "EFI（电子控制燃油喷射系统）", "EFI（电子控制燃油喷射系统）"],
        "排气量(mL)": ["1998", "1998", "1998", "1998", "1998", "1998", "1998", "1998"],
        "最大功率(kw/rpm)": ["162/4800-5600", "162/4800-5600", "162/4800-5600", "162/4800-5600", "162/4800-5600", "162/4800-5600", "162/4800-5600", "162/4800-5600"],
        "最大扭矩(Nm/rpm)": ["350/1700-4000", "350/1700-4000", "350/1700-4000", "350/1700-4000", "350/1700-4000", "350/1700-4000", "350/1700-4000", "350/1700-4000"],
        "Stop & Start System智能节油启停系统": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "变速系统": ["6AT （带雪地模式）", "6AT （带雪地模式）", "6AT （带雪地模式）", "6AT （带雪地模式）", "6AT （带雪地模式）", "6AT （带雪地模式）", "6AT （带雪地模式）", "6AT （带雪地模式）"]
    },
    "制动、悬挂、驱动方式": {
        "驱动系统": ["2WD", "2WD", "2WD", "2WD", "动态扭矩分配控制4WD （带锁定模式）", "动态扭矩分配控制4WD （带锁定模式）", "动态扭矩分配控制4WD （带锁定模式）", "动态扭矩分配控制4WD （带锁定模式）"],
        "前悬架系统": ["麦弗逊式悬架", "麦弗逊式悬架", "麦弗逊式悬架", "麦弗逊式悬架", "麦弗逊式悬架", "麦弗逊式悬架", "麦弗逊式悬架", "麦弗逊式悬架"],
        "后悬架系统": ["双叉臂式悬架 （副车架+簧震分离式）", "双叉臂式悬架 （副车架+簧震分离式）", "双叉臂式悬架 （副车架+簧震分离式）", "双叉臂式悬架 （副车架+簧震分离式）", "双叉臂式悬架 （副车架+簧震分离式）", "双叉臂式悬架 （副车架+簧震分离式）", "双叉臂式悬架 （副车架+簧震分离式）", "双叉臂式悬架 （副车架+簧震分离式）"],
        "转向系统 ": ["EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统", "EPS电子助力转向系统"],
        "制动系统(前/后)": ["前：通风式碟刹/后：实心式碟刹", "前：通风式碟刹/后：实心式碟刹", "前：通风式碟刹/后：实心式碟刹", "前：通风式碟刹/后：实心式碟刹", "前：通风式碟刹/后：实心式碟刹", "前：通风式碟刹/后：实心式碟刹", "前：通风式碟刹/后：实心式碟刹", "前：通风式碟刹/后：实心式碟刹"]
    },
    "外观与视野": {
        "前格栅": ["哑光前栅栏", "哑光前栅栏", "哑光前栅栏", "尊贵版专属镀铬前栅栏", "哑光前栅栏", "哑光前栅栏", "尊贵版专属镀铬前栅栏", "镀铬前栅栏"],
        "轮胎尺寸": ["245/60 R18", "245/60 R18", "245/55 R19", "245/55 R19", "245/60 R18", "245/55 R19", "245/55 R19", "245/55 R19"],
        "透镜式卤素前大灯": ["●", "●", "●", "●", "●", "●", "●", "－"],
        "透镜式LED前大灯\n（带清洗装置）": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "前大灯水平控制系统": ["●手动", "●手动", "●自动", "●自动", "●手动", "●自动", "●自动", "●自动"],
        "LED日间行车灯": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "LED组合尾灯": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "可折叠外后视镜（带转向灯）": ["●", "●", "●电动折叠", "●电动折叠", "●", "●电动折叠", "●电动折叠", "●电动折叠，带加热,记忆功能，BSM显示"],
        "分段式全景天窗（可开启，带防夹功能）": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "车顶行李架": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "前挡风玻璃除冰功能": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "前排侧窗斥水玻璃": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "后挡风玻璃除雾功能": ["●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "内饰": {
        "豪华科技中控台": ["●", "●", "●", "●", "●", "●", "●", "●（带木纹装饰，氛围灯）"],
        "多功能信息显示系统": ["●3.5英寸 单色LCD", "●3.5英寸 单色LCD", "●4.2英寸彩色TFT", "●4.2英寸彩色TFT", "●3.5英寸 单色LCD", "●4.2英寸彩色TFT", "●4.2英寸彩色TFT", "●4.2英寸彩色TFT"],
        "豪华地毯": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "自动防眩目内后视镜": ["－", "－", "●", "●", "－", "●", "●", "●"]
    },
    "座椅": {
        "前排、第二排\n座椅材质": ["高级织物", "高级织物", "真皮+合成皮", "真皮+合成皮", "高级织物", "真皮+合成皮", "真皮+合成皮", "真皮+合成皮"],
        "第三排座椅\n座椅材质": ["-", "高级织物", "合成皮", "合成皮", "高级织物", "合成皮", "合成皮", "合成皮"],
        "前排座椅调节": ["●\n驾驶席6向手动\n副驾席4向手动", "●\n驾驶席6向手动\n副驾席4向手动", "●\n驾驶席8向电动\n副驾席4向电动", "●\n驾驶席8向电动\n副驾席4向电动", "●\n驾驶席6向手动\n副驾席4向手动", "●\n驾驶席8向电动\n副驾席4向电动", "●\n驾驶席8向电动\n副驾席4向电动", "●\n驾驶席8向电动，带记忆功能\n副驾席4向电动"],
        "前排座椅加热装置": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "前排座椅通风": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "驾驶席带电动腰靠": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "驾驶席座椅记忆功能": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "第二排座椅\n（可倾斜，放平，滑动，带6:4分割。）": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "第三排座椅\n（可倾斜，放平，带6:4分割。）": ["－", "●", "●", "●", "●", "●", "●", "●"]
    },
    "便利设备": {
        "多功能方向盘": ["●", "●", "●真皮", "●真皮", "●", "●真皮", "●真皮", "●真皮，带加热"],
        "四门电动车窗（驾驶席/副驾席一触式）": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "智能钥匙，一键启动系统": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "三区独立自动恒温空调": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "倒车影像系统（带倒车轨迹引导线）": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "PVM全景监控系统": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "光感式智能前大灯系统": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "全方位泊车雷达（6探头）": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "智能防夹电动尾门": ["－", "－", "－", "●", "－", "－", "●", "●"],
        "可开启式后挡风玻璃": ["－", "－", "－", "●", "－", "－", "●", "●"],
        "6.1英寸触摸屏娱乐系统": ["●", "●", "●", "－", "●", "●", "－", "－"],
        "10英寸电子语音导航系统": ["－", "－", "－", "●", "－", "－", "●", "●"],
        "蓝牙免提及蓝牙音频播放": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "AUX+USB音频接口": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "后排双USB充电接口（2.1A)": ["●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "Toyota Safety Sense智行安全（丰田规避碰撞辅助套装）": {
        "PCS预碰撞安全系统": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "DRCC动态雷达巡航控制系统": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "LDA车道偏离警示系统": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "AHB自动调节远光灯系统": ["－", "－", "●", "●", "－", "●", "●", "●"]
    },
    "安全": {
        "BSM并线盲点监测系统": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "RCTA倒车侧后方盲点警示系统": ["－", "－", "－", "－", "－", "－", "－", "●"],
        "TPMS胎压监测系统": ["－", "－", "●", "●", "－", "●", "●", "●"],
        "ABS防抱死制动系统": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "BA制动辅助系统": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "VSC车身稳定控制系统": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "TRC牵引力控制系统": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "HAC坡路起步辅助控制系统": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "DAC下坡辅助控制系统": ["－", "－", "－", "－", "●", "●", "●", "●"],
        "驾驶员、副驾驶位正面SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "驾驶员膝部SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "前排侧SRS空气囊+侧窗帘式SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "防盗系统(带警报＋发动机停机装置)": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "儿童保护门锁": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "ISOFIX儿童座椅固定装置": ["●", "●", "●", "●", "●", "●", "●", "●"],
        "丰田纯正儿童座椅": ["○", "○", "○", "○", "○", "○", "○", "○"]
    }
}

VEHICLE_HLD_MODEL = ['2.0T 两驱精英版（五座）', '2.0T 两驱精英版', '2.0T 两驱豪华版', '2.0T 两驱尊贵版', '2.0T 四驱精英版', '2.0T 四驱豪华版', '2.0T 四驱尊贵版', '2.0T 四驱至尊版']

# // 凯美瑞+运动+双擎
# // https://www.gac-toyota.com.cn/minisite/campaigns/2017/camry/js/map/hevmap.js
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2017/camryxle/config/?model=2.5q&ly=xle

VEHICLE_KMR_CONFIG = {
    "": {
        "官方指导价": [
            "17.98万元",
            "18.98万元",
            "19.98万元",
            "21.98万元",
            "25.98万元",
            "20.58万元",
            "22.28万元",
            "23.98万元",
            "27.98万元",
            "24.28万元",
        ]
    },
    "基本项目": {
        "长×宽×高（mm）": ["4885 × 1840 × 1455", "4885 × 1840 × 1455", "4885 × 1840 × 1455", "4885 × 1840 × 1455", "4885 × 1840 × 1455", "4900 × 1840 × 1455", "4900 × 1840 × 1455", "4885 × 1840 × 1455", "4885 × 1840 × 1455",
                      "4900 × 1840 × 1455"],
        "轴距（mm）": ["2825", "2825", "2825", "2825", "2825", "2825", "2825", "2825", "2825", "2825"],
        "前/后轮距（mm）": ["1595/1605", "1585/1595", "1585/1595", "1575/1585", "1575/1585", "1575/1585", "1575/1585", "1575/1585", "1575/1585", "1575/1585"],
        "整备质量（kg）": ["1530", "1550", "1555", "1585", "1610", "1560", "1570", "1665", "1695", "1650"],
        "综合工况油耗（L/100km）": ["5.5", "5.7", "5.7", "6.0", "6.0", "5.8", "6.0", "4.1", "4.1", "4.1"],
        "油箱容积": ["60L", "60L", "60L", "60L", "60L", "60L", "60L", "国五：50L（国六：49L）", "国五：50L（国六：49L）", "国五：50L（国六：49L）"]
    },
    "动力系统": {
        "发动机型式": ["直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统",
                  "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统",
                  "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统",
                  "直列四缸/16气门-DOHC 顶置双凸轮轴 /VVT-iE 智能电动可变气门正时进气系统/VVT-i智能可变气门正时电子控制系统"],
        "供油方式": ["EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射供油系统", "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射供油系统", "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射供油系统", "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射供油系统", "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射供油系统",
                 "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 \n双喷射供油系统", "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 \n双喷射供油系统", "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射 供油系统", "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射 供油系统",
                 "EFI 电子控制燃油喷射系统\nD-4S 缸内直喷+进气歧管喷射 双喷射 供油系统"],
        "排气量（mL）": ["1987", "1987", "1987", "2487", "2487", "1987", "2487", "2487", "2487", "2487"],
        "压缩比": ["13.0:1", "13.0:1", "13.0:1", "13.0:1", "13.0:1", "13.0:1", "13.0:1", "14.0:1", "14.0:1", "14.0:1"],
        "最大功率（kW/rpm）": ["131/6600", "131/6600", "131/6600", "154/6600", "154/6600", "131/6600", "154/6600", "131/5700", "131/5700", "131/5700"],
        "最大扭矩（Nm/rpm）": ["210/4400-5200", "210/4400-5200", "210/4400-5200", "250/5000", "250/5000", "210/4400-5200", "250/5000", "221/3600-5200", "221/3600-5200", "221/3600-5200"],
        "缸径×行程（mm×mm）": ["80.5×97.6", "80.5×97.6", "80.5×97.6", "87.5× 103.4", "87.5× 103.4", "80.5×97.6", "87.5× 103.4", "87.5× 103.4", "87.5× 103.4", "87.5× 103.4"],
        "Stop & Start System智能节油启停系统": ["●", "●", "●", "●", "●", "●", "●", "-", "-", "-"],
        "最高车速（km/h）": ["205", "205", "205", "210", "210", "205", "210", "180", "180", "180"],
        "变速箱形式": ["Direct Shift-CVT（模拟10速CVT变速箱）", "Direct Shift-CVT（模拟10速CVT变速箱）", "Direct Shift-CVT（模拟10速CVT变速箱）", "Direct Shift-8AT", "Direct Shift-8AT", "Direct Shift-CVT（模拟10速CVT变速箱）", "Direct Shift-8AT", "新一代E-CVT电子无级变速系统",
                  "新一代E-CVT电子无级变速系统", "新一代E-CVT电子无级变速系统"]
    },
    "双擎动力系统": {
        "型式": ["-", "-", "-", "-", "-", "-", "-", "混联式", "混联式", "混联式"],
        "电动机类型": ["-", "-", "-", "-", "-", "-", "-", "永磁同步电机", "永磁同步电机", "永磁同步电机"],
        "电动机峰值功率（kW）": ["-", "-", "-", "-", "-", "-", "-", "88", "88", "88"],
        "电动机峰值扭矩（Nm）": ["-", "-", "-", "-", "-", "-", "-", "202", "202", "202"],
        "系统最大输出功率（kW）": ["-", "-", "-", "-", "-", "-", "-", "160", "160", "160"],
        "电池型式": ["-", "-", "-", "-", "-", "-", "-", "金属氢化物镍蓄电池", "金属氢化物镍蓄电池", "金属氢化物镍蓄电池"],
        "电池模块数量": ["-", "-", "-", "-", "-", "-", "-", "34", "34", "34"],
        "电池容量（Ah）": ["-", "-", "-", "-", "-", "-", "-", "6.5", "6.5", "6.5"],
        "EV纯电动模式": ["-", "-", "-", "-", "-", "-", "-", "●", "●", "●"]
    },
    "悬架·制动·驱动方式": {
        "前后悬架系统": ["前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架", "前 : 麦弗逊式悬架 后: 双叉臂式悬架",
                   "前 : 麦弗逊式悬架 后: 双叉臂式悬架"],
        "转向助力系统": ["高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统", "高精度齿条并行式电动助力转向系统"],
        "前后制动系统": ["通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹", "通风盘式碟刹/实心盘式碟刹"],
        "驱动方式": ["前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱", "前置前驱"]
    },
    "XSE 专属运动个性设计": {
        "炫酷运动式前保险杠": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "蜂窝网状凌厉进气格栅": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "鹰眼熏黑立体LED大灯（带波纹状LED日间行车灯）": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "空气动力学后保险杠": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "动感4炮筒式排气管": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "-"],
        "飞翼式运动尾翼": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "18英寸劲酷双色铝合金轮毂": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "换挡拨片": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "-"],
        "方格金属纹理饰条": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "SPORTIVO运动地毯": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"]
    },
    "外观": {
        "电动天窗（带防夹功能）": ["●", "●", "●", "-", "-", "●", "●", "-", "-", "●"],
        "分段式全景天窗（可开启，带防夹功能）": ["-", "-", "-", "●", "●", "-", "-", "●", "●", "-"],
        "防紫外线玻璃": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "降噪声学前挡风玻璃": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "左右炮筒式排气管": ["●", "●", "●", "●", "●", "●4炮筒式", "●4炮筒式", "-", "-", "-"],
        "铝合金轮毂": ["●16英寸", "●17英寸", "●17英寸", "●18英寸", "●18英寸", "●18英寸双色", "●18英寸双色", "●18英寸高光", "●18英寸高光", "●18英寸双色"],
        "轮胎尺寸": ["205/65 R16", "215/55 R17", "215/55 R17", "235/45 R18", "235/45 R18", "235/45 R18", "235/45 R18", "235/45 R18", "235/45 R18", "235/45 R18"],
        "智能沉降型隐藏雨刷": ["●", "●", "●雨量感应式", "●雨量感应式", "●雨量感应式", "●雨量感应式", "●雨量感应式", "●雨量感应式", "●雨量感应式", "●雨量感应式"],
        "电动折叠外后视镜（带加热、电动调节）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "车底空气动力学导流板": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "带位置记忆、倒车辅助功能外后视镜": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "电子防眩目内后视镜": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "降噪声学前侧窗玻璃": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "鲨鱼鳍天线": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"]
    },
    "灯光": {
        "鹰眼立体LED大灯（远近光一体）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "飞翼式LED日间行车灯": ["●", "●", "-", "-", "-", "-", "-", "-", "-", "-"],
        "波纹状LED日间行车灯": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "光感式智能前大灯系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED前雾灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED组合尾灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "内饰": {
        "自发光仪表": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "彩色TFT多功能信息显示屏": ["●4.2英寸", "●4.2英寸", "●7英寸", "●7英寸", "●7英寸", "●7英寸", "●7英寸", "●7英寸", "●7英寸", "●7英寸"],
        "豪华地毯": ["●", "●", "●", "●", "●", "●运动型", "●运动型", "●", "●", "●运动型"],
        "金属迎宾踏板": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "多功能方向盘": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "真皮方向盘&换挡杆": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "方向盘电动调节+位置记忆功能": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "电动后窗遮阳帘": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "后侧窗遮阳帘": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "后排中央扶手空调娱乐控制面板": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"]
    },
    "座椅": {
        "高级织物座椅": ["●", "-", "-", "-", "-", "●", "-", "-", "-", "-"],
        "真皮+合成皮座椅": ["-", "●", "●", "●", "●", "-", "●", "●", "●", "●"],
        "驾驶席6向手动调节，副驾驶席4向手动调节": ["●", "-", "-", "-", "-", "●", "-", "-", "-", "-"],
        "驾驶席10向电动调节（含2向电动腰靠），副驾驶席4向手动调节": ["-", "-", "-", "-", "-", "-", "●", "-", "-", "●"],
        "驾驶席10向电动调节（含2向电动腰靠），副驾驶席4向电动调节": ["-", "●", "●", "●", "-", "-", "-", "●", "-", "-"],
        "驾驶席10向电动调节（含2向电动腰靠），副驾驶席10向电动调节（含2向电动腰靠）": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "副驾驶席座椅后排电动可调": ["-", "●", "●", "●", "●", "-", "-", "●", "●", "-"],
        "后排座椅4/6分割": ["-", "●", "●", "●", "-", "●", "●", "●", "-", "●"],
        "驾驶席座椅记忆功能": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "后排座椅靠背电动调节": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "前排座椅加热/通风功能": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"]
    },
    "安全": {
        "TPMS胎压监测系统": ["●", "●", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示", "●带数值显示"],
        "四角泊车雷达": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "倒车影像功能（带动态引导线）": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "PVM全景监控系统": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "BSM并线盲点监测系统": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "RCTA倒车侧后方盲点警示系统": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "驾驶席、副驾驶席正面SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "驾驶席、副驾驶席膝部SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排侧SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "侧窗帘式SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后排侧SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "ABS防抱死制动系统（带 EBD电子制动力分配系统）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "VSC车身稳定控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "TRC牵引力控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "HAC坡路起步辅助控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "BA制动辅助系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "ISOFIX儿童座椅固定装置": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "丰田纯正儿童座椅": ["○", "○", "○", "○", "○", "○", "○", "○", "○", "○"]
    },
    "Toyota Safety Sense智行安全（丰田规避碰撞辅助套装）": {
        "PCS预碰撞安全系统": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "DRCC动态雷达巡航控制系统": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LDA车道偏离警示系统": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "AHB自动调节远光灯系统": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "舒适·便捷": {
        "左右双区独立全自动空调": ["●", "●", "●", "●", "-", "●", "●", "●", "-", "●"],
        "三区独立全自动空调": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "nanoe™纳米水离子发生器": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "空调滤清器（可对应PM2.5）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "空调后排出风口": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "智能钥匙、一键启动": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "驾驶席触摸式门锁系统": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "EPB电子驻车系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "电控开启油箱盖": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "四门车窗一键升降（带防夹功能）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "行车自动落锁功能": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "驾驶模式调节（普通、节能、运动）": ["-", "-", "-", "●", "●", "●", "●", "●", "●", "●"],
        "后排双USB充电接口（2.1A）": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后排220V电源": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"]
    },
    "三屏联动智能显示": {
        "10英寸彩色HUD平视显示系统": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "7英寸彩色TFT多功能信息显示屏": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "彩色中控触控导航显示屏": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "音响·娱乐": {
        "彩色中控触控显示屏（带智能手机互联系统）": ["-", "-", "●9英寸", "●9英寸", "●8英寸", "●9英寸", "●9英寸", "●9英寸", "●8英寸", "●9英寸"],
        "车载语音导航系统": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "车载蓝牙（带免提电话及音乐播放功能）": ["-", "-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "G-Book智能副驾系统": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "AUX+USB音频接口": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "高级音响系统（带6扬声器）": ["●", "●", "●", "●", "-", "●", "●", "●", "-", "●"],
        "JBL 高级环绕音响系统（带9扬声器，Clari-Fi音源修复技术）": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "CD音响系统": ["●", "●", "-", "-", "●", "-", "-", "-", "●", "-"]
    },
    "外板色-单色车身色": {
        "墨晶黑": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "铂金珍珠白": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "欧泊银": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "耀动红": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "虎睛棕": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "海钻蓝": ["-", "-", "-", "-", "-", "-", "-", "●", "●", "●"]
    },
    "外板色-双色车身色": {
        "铂金珍珠白黑双色": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"],
        "耀动红黑双色": ["-", "-", "-", "-", "-", "●", "●", "-", "-", "●"]
    },
    "内饰色": {
        "米色": ["●", "●", "●", "●", "●", "-", "-", "●", "●", "-"],
        "黑色": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "红色": ["-", "-", "-", "-", "-", "-", "●", "-", "-", "●"]
    }
}

VEHICLE_KMR_MODEL = ["2.0E 精英版", "2.0E 领先版", "2.0G 豪华版", "2.5G 豪华版", "2.5Q 旗舰版", "2.0S 锋尚版", "2.5S 锋尚版", "2.5HG 豪华版", "2.5HQ 旗舰版", "2.5HS 锋尚版"]

# // 致享
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2017/YarislzhixiangTable?module=15GSxd
# // https://www.gac-toyota.com.cn/minisite/campaigns/2017/YarislzhixiangTable_new/js/data.js

VEHICLE_ZHX_CONFIG = {
    "": {
        "官方指导价": [
            "6.88万元",
            "7.58万元",
            "8.38万元",
            "7.98万元",
            "8.78万元",
            "8.78万元",
            "9.58万元",
            "9.78万元",
            "10.48万元"
        ]
    },
    "车身参数": {
        "长×宽×高 mm": ["4440×1700×1490", "4440×1700×1490", "4440×1700×1490", "4440×1700×1490", "4440×1700×1490", "4440×1700×1490", "4440×1700×1490", "4440×1700×1490", "4440×1700×1490"],
        "轴距 mm": ["2550", "2550", "2550", "2550", "2550", "2550", "2550", "2550", "2550"],
        "油箱容积 L": ["42", "42", "42", "42", "42", "42", "42", "42", "42"],
        "悬挂系统 (前/后)": ["麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂"],
        "制动系统 (前/后)": ["通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式"],
        "转向系统": ["EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统"],
        # "排放": ["国五排放标准", "国五排放标准", "国五排放标准", "国六排放标准", "国六排放标准", "国六排放标准", "国六排放标准", "国六排放标准", "国六排放标准"]
    },
    "高效动力": {
        "发动机类型": ["直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统",
                  "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统",
                  "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统"],
        "排气量 cc": ["1329", "1329", "1329", "1496", "1496", "1496", "1496", "1496", "1496"],
        "最大功率 kW/rpm": ["73/6000", "73/6000", "73/6000", "81/6000", "81/6000", "81/6000", "81/6000", "81/6000", "81/6000"],
        "最大扭矩 Nm/rpm": ["123/4200", "123/4200", "123/4200", "138/4200", "138/4200", "138/4200", "138/4200", "138/4200", "138/4200"],
        "变速箱型式": ["五速手动", "五速手动", "S-CVT", "五速手动", "S-CVT", "五速手动", "S-CVT", "S-CVT", "S-CVT"],
        "90km/h等速油耗  L/100km": ["4.1", "4.1", "4.1", "4.2", "4.2", "4.2", "4.2", "4.2", "4.2"],
        "百公里综合工况油耗  L/100km": ["5.2", "5.2", "5.1", "5.2", "5.1", "5.2", "5.1", "5.1", "5.1"],
        "轮胎规格": ["175/65 R14", "175/65 R14", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15"],
        "Stop & Start System智能节油启停系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "安全装备": {
        "ABS防抱死制动系统(带EBD)": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "BA制动辅助系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "VSC车身稳定控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "TRC牵引力控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "HAC坡路起步辅助控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排双SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排侧SRS空气囊": ["-", "-", "-", "-", "-", "●", "●", "●", "●"],
        "发动机防盗锁止系统": ["-", "-", "-", "-", "-", "●", "●", "●", "●"],
        "前排ELR Seat Belts预紧限力式安全带": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后排全席ELR Seat Belts预紧限力式安全带": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排座椅安全带未系提醒": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "儿童安全门锁": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "ISOFIX儿童座椅固定装置": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "丰田纯正儿童座椅": ["○", "○", "○", "○", "○", "○", "○", "○", "○"]
    },
    "外观": {
        "晶体式前大灯": ["●", "●", "●", "●", "●", "●", "●", "●", "-"],
        "透镜式前大灯": ["-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "前大灯水平调节装置": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED日间行车灯": ["-", "-", "-", "●", "●", "●", "●", "●", "●"],
        "LED示廓灯": ["-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "带LED组合尾灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED高位刹车灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前雾灯": ["-", "-", "-", "-", "-", "●", "●", "●", "●"],
        "一键式防夹电动天窗": ["-", "-", "-", "-", "-", "-", "-", "●", "●"],
        "四门电动车窗(驾驶席一键向下)": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "电动调节外后视镜": ["-", "●", "●", "●", "●", "●", "●", "●", "●"],
        "钢制轮毂（带轮罩）": ["●", "●", "●", "●", "●", "-", "-", "-", "-"],
        "铝合金轮毂": ["-", "-", "-", "-", "-", "●", "●", "●", "●"]
    },
    "内饰": {
        "炮筒式运动仪表盘": ["●", "●", "●", "●", "●", "-", "-", "-", "-"],
        "立体式自发光仪表盘": ["-", "-", "-", "-", "-", "●", "●", "●", "●"],
        "豪华缝线装饰": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "豪华环舱饰件(钢琴烤漆)": ["-", "-", "-", "-", "-", "●", "●", "●", "●"],
        "驾驶席六向/副驾驶席四向手动调节": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "一体式前排中央扶手（带储物功能及杯架）": ["-", "-", "-", "●", "●", "●", "●", "●", "●"],
        "座椅材质": ["高级织物", "高级织物", "高级织物", "高级织物", "高级织物", "双色高级织物", "双色高级织物", "双色高级织物", "真皮+合成皮"],
        "方向盘&换档杆材质": ["高级合成材料", "高级合成材料", "高级合成材料", "高级合成材料", "高级合成材料", "高级合成材料", "高级合成材料", "高级合成材料", "高级真皮"],
        "前排遮阳板带化妆镜": ["-", "-", "-", "-", "-", "●(驾驶席)", "●(驾驶席)", "●(驾驶席)", "●(驾驶席/副驾席)"],
        "前排阅读灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "行李厢照明(与尾门开关联动)": ["●", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "舒适及便捷装备": {
        "遥控钥匙": ["-", "●", "●", "●", "●", "●", "●", "●", "-"],
        "智能钥匙&一键启动": ["-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "节能环保型手动空调": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "高保真扬声器": ["●(2个)", "●(2个)", "●(2个)", "●(2个)", "●(2个)", "●(4个)", "●(4个)", "●(4个)", "●(4个)"],
        "音响系统(带收音机，USB+AUX多媒体端口)": ["-", "●", "●", "●", "●", "●(单碟CD)", "●(单碟CD)", "●(单碟CD)", "●(单碟CD)"],
        "定速巡航系统": ["-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "集成控制式多功能方向盘": ["-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "多功能信息显示屏": ["-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "ECO节油驾驶显示系统": ["-", "-", "●", "-", "●", "-", "●", "●", "●"],
        "遥控中央集控门锁": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "车厢迎宾照明系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "4/6分割可折叠后排座椅": ["-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "发动机隔音棉": ["●", "●", "●", "●", "●", "●", "●", "●", "●"]
    }
}

VEHICLE_ZHX_MODEL = ["1.3灵动版（MT）", "1.3E魅动版（MT）", "1.3E魅动版（CVT）", "1.5E魅动版（MT）", "1.5E魅动版（CVT）", "1.5G炫动版（MT）", "1.5G炫动版（CVT）", "1.5G炫动天窗版（CVT）", "1.5GS锐动版（CVT）"]

# // 致炫
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2016/NewYarisLTable?module=15rd
# // https://www.gac-toyota.com.cn/minisite/campaigns/2016/NewYarisLTable_new/js/data.js
VEHICLE_ZHXUAN_CONFIG = {
    "": {
        "官方指导价": [
            '6.68万元',
            '7.48万元',
            '8.28万元',
            '8.58万元',
            '8.93万元',
            '8.58万元',
            '9.38万元',
            '9.58万元',
            '9.93万元',
            '10.28万元'
        ]
    },

    "车身参数": {
        "长×宽×高 mm": ["4160×1700×1485", "4160×1700×1485", "4160×1700×1495", "4160×1700×1495", "4160×1700×1495", "4160×1700×1495", "4160×1700×1495", "4160×1700×1495", "4160×1700×1495", "4160×1700×1495"],
        "轴距 mm": ["2550", "2550", "2550", "2550", "2550", "2550", "2550", "2550", "2550", "2550"],
        "油箱容积 L": ["42", "42", "42", "42", "42", "42", "42", "42", "42", "42"],
        "悬挂系统 (前/后)": ["麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂", "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂",
                       "麦弗逊式独立悬挂/扭力梁式拖曳臂悬挂"],
        "制动系统 (前/后)": ["通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式", "通风盘式/鼓式"],
        "转向系统": ["EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统", "EPS电动助力转向系统"],
        # "排放": ["国五排放标准", "国五排放标准", "国五排放标准", "国六排放标准", "国六排放标准", "国六排放标准", "国六排放标准", "国六排放标准", "国六排放标准", "国六排放标准"]
    },
    "高效动力": {
        "发动机类型": ["直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统",
                  "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统",
                  "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统", "直列四缸/16气门-DOHC顶置双凸轮轴/ Dual VVT-i双智能可变气门正时电子控制系统"],
        "排气量 cc": ["1329", "1329", "1329", "1496", "1496", "1496", "1496", "1496", "1496", "1496"],
        "最大功率 kW/rpm": ["73/6000", "73/6000", "73/6000", "81/6000", "81/6000", "81/6000", "81/6000", "81/6000", "81/6000", "81/6000"],
        "最大扭矩 Nm/rpm": ["123/4200", "123/4200", "123/4200", "138/4200", "138/4200", "138/4200", "138/4200", "138/4200", "138/4200", "138/4200"],
        "变速箱型式": ["五速手动", "五速手动", "S-CVT", "S-CVT", "S-CVT", "五速手动", "S-CVT", "S-CVT", "S-CVT", "S-CVT"],
        "90km/h等速油耗  L/100km": ["≤4.4", "≤4.4", "≤4.4", "4.3", "4.3", "4.2", "4.3", "4.3", "4.3", "4.3"],
        "百公里综合工况油耗  L/100km": ["5.3", "5.3", "5.2", "5.2", "5.2", "5.3", "5.2", "5.2", "5.2", "5.2"],
        "百公里加速时间 s，0~100km/h": ["12.0", "12.0", "12.1", "11.6", "11.6", "11.7", "11.6", "11.6", "11.6", "11.6"],
        "轮胎规格": ["175/65 R14", "175/65 R14", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15", "185/60 R15"],
        "Stop & Start System智能节油启停系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "安全装备": {
        "ABS防抱死制动系统(带EBD)": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "BA制动辅助系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "VSC车身稳定控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "TRC牵引力控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "HAC坡路起步辅助控制系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排双SRS空气囊": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排侧SRS空气囊": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"],
        "发动机防盗锁止系统": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"],
        "前排ELR Seat Belts预紧限力式安全带": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后排全席ELR Seat Belts预紧限力式安全带": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前排座椅安全带未系提醒": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "儿童安全门锁": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "ISOFIX儿童座椅固定装置": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "丰田纯正儿童座椅": ["○", "○", "○", "○", "○", "○", "○", "○", "○", "○"]
    },
    "外观": {
        "前/后动感空气套件": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "炫彩侧裙套件": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "旋风扰流尾翼": ["-", "-", "-", "-", "●", "-", "-", "-", "●", "-"],
        "晶体式前大灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "-"],
        "透镜式前大灯": ["-", "-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "前大灯水平调节装置": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED日间行车灯": ["-", "-", "-", "●", "●", "●", "●", "●", "●", "●"],
        "LED示廓灯": ["-", "-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "带LED鹰爪式组合尾灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "LED高位刹车灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "前雾灯": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"],
        "一键式防夹电动天窗": ["-", "-", "-", "-", "-", "-", "-", "●", "●", "●"],
        "四门电动车窗(驾驶席一键向下)": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "电动调节外后视镜": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "后雨刮": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "钢制轮毂（带轮罩）": ["●", "●", "●", "●", "●", "-", "-", "-", "-", "-"],
        "铝合金轮毂": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"],
        "隐藏式C柱设计": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "内饰": {
        "炮筒式运动仪表盘": ["●", "●", "●", "●", "●", "-", "-", "-", "-", "-"],
        "立体式自发光仪表盘": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"],
        "豪华缝线装饰": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "豪华环舱饰件(钢琴烤漆)": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"],
        "驾驶席六向/副驾驶席四向手动调节": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "一体式前排中央扶手（带储物功能及杯架）": ["-", "-", "-", "●", "●", "●", "●", "●", "●", "●"],
        "动感织物座椅": ["●", "●", "●", "●", "●", "●(双色高级织物)", "●(双色高级织物)", "●(双色高级织物)", "●(双色高级织物)", "-"],
        "豪华混搭座椅": ["-", "-", "-", "-", "-", "-", "-", "-", "-", "●(合成皮+高级织物)"],
        "前排遮阳板带化妆镜": ["-", "-", "-", "-", "-", "●(驾驶席)", "●(驾驶席)", "●(驾驶席)", "●(驾驶席)", "●(驾驶席/副驾席)"],
        "前排阅读灯": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "行李厢照明(与尾门开关联动)": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"]
    },
    "舒适及便捷装备": {
        "遥控钥匙": ["-", "●", "●", "●", "●", "●", "●", "●", "●", "-"],
        "智能钥匙&一键启动": ["-", "-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "节能环保型手动空调": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "高保真扬声器": ["●(2个)", "●(2个)", "●(2个)", "●(2个)", "●(2个)", "●(4个)", "●(4个)", "●(4个)", "●(4个)", "●(4个)"],
        "音响系统(带收音机，USB+AUX多媒体端口)": ["-", "●", "●", "●", "●", "●(单碟CD)", "●(单碟CD)", "●(单碟CD)", "●(单碟CD)", "●(单碟CD)"],
        "定速巡航系统": ["-", "-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "集成控制式多功能方向盘": ["-", "-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "多功能信息显示屏": ["-", "-", "-", "-", "-", "-", "-", "-", "-", "●"],
        "ECO节油驾驶显示系统": ["-", "-", "●", "●", "●", "-", "●", "●", "●", "●"],
        "遥控中央集控门锁": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "车厢迎宾照明系统": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "4/6分割可折叠后排座椅": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "可收纳式行李厢盖板": ["-", "-", "-", "-", "-", "●", "●", "●", "●", "●"],
        "行李厢便利挂钩(4个)": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"],
        "发动机隔音棉": ["●", "●", "●", "●", "●", "●", "●", "●", "●", "●"]
    }
}

VEHICLE_ZHXUAN_MODEL = ["1.3灵动版（MT）", "1.3E魅动版（MT）", "1.3E魅动版（CVT）", "1.5E魅动版（CVT）", "1.5E劲速升级版（CVT）", "1.5G炫动版（MT）", "1.5G炫动版（CVT）", "1.5G炫动 天窗版（CVT）", "1.5G劲速天窗升级版（CVT）", "1.5GS锐动版（CVT）"]

# // 埃尔法
# // https://www.gac-toyota.com.cn/vehicles/alphard
# // https://www.gac-toyota.com.cn/minisite/campaigns/2015/NewAlphard/elmethodMinisite/js/hevmap.js
VEHICLE_ALPHA_CONFIG = {
    "": {
        "官方指导价": ["80.50万元", "85.60万元"]
    },
    "■基本项目": {
        "长 x 宽 x 高（mm）": ["4975×1850×1890", "4975×1850×1890"],
        "轴距（mm）": ["3000", "3000"],
        "前/后 轮距（mm）": ["1600/1595", "1600/1595"],
        "最小离地间隙（mm）": ["170", "170"],
        "最小转弯半径（m）": ["5.6", "5.6"],
        "整备质量（kg）": ["2270", "2290"],
        "满载质量（kg）": ["2815", "2815"],
        "轮胎尺寸": ["225/ 60R17", "225/ 60R17"],
        "座位数": ["7座", "7座"]
    },
    "■动力系统": {
        "发动机型号": ["直列4缸 DOHC顶置双凸轮轴 16气门带VVT-i智能可变气门正时电子控制系统", "直列4缸 DOHC顶置双凸轮轴 16气门带VVT-i智能可变气门正时电子控制系统"],
        "排气量（cc）": ["2494", "2494"],
        "压缩比": ["12.5 : 1", "12.5 : 1"],
        "最大功率（kW/rpm）": ["86/4700", "86/4700"],
        "最大扭矩（Nm/rpm）": ["198 /(2800-4000)", "198 /(2800-4000)"],
        "燃油供给装置": ["EFI(电子控制燃油喷射系统)", "EFI(电子控制燃油喷射系统)"],
        "变速系统": ["E-CVT电子无级变速系统", "E-CVT电子无级变速系统"],
        "油箱容积（L）": ["58", "58"]
    },
    "■双擎动力系统": {
        "型式": ["混联式", "混联式"],
        "电动机类型": ["永磁同步电机", "永磁同步电机"],
        "前电动机最大功率（kW）": ["105", "105"],
        "前电动机最大扭矩（Nm）": ["270", "270"],
        "后电动机最大功率（kW）": ["50", "50"],
        "后电动机最大扭矩（Nm）": ["139", "139"],
        "EV纯电动模式": ["●", "●"],
        "ECO节油驾驶模式": ["●", "●"],
        "系统综合功率（kW）": ["119", "119"],
        "综合工况油耗(L/100km)": ["7.1", "7.1"]
    },
    "■制动·悬挂·驱动方式": {
        "制动系统（前/后）": [" 通风式碟刹", " 通风式碟刹"],
        "悬挂系统 （前/后）": ["麦弗逊式/双叉臂式带横向稳定杆", "麦弗逊式/双叉臂式带横向稳定杆"],
        "驱动方式": ["E-FOUR(电动四驱系统)", "E-FOUR(电动四驱系统)"]
    },
    "■外观": {
        "LED前大灯（集成转角照明系统、带自动水平控制系统）": ["●", "●"],
        "LED日间行车灯": ["●", "●"],
        "LED前雾灯": ["●", "●"],
        "LED流水式转向灯": ["●", "●"],
        "前挡风防红外线玻璃": ["●", "              ●（带降噪功能）"],
        "前侧窗防红外线及紫外线玻璃": ["●", "              ●（带降噪功能）"],
        "后侧窗防红外线及紫外线玻璃": ["-", "              ●（带降噪功能）"],
        "后侧角窗/后窗防紫外线玻璃": ["-", "●"],
        "后侧窗/后侧角窗/后窗隐私玻璃": ["●", "●"],
        "雨量感应式雨刮系统(间歇可调)": ["●", "●"],
        "外后视镜（带转向灯，电动折叠，加热，记忆及倒车辅助功能）": ["●", "●"],
        "后窗隐藏式雨刷": ["●", "●"],
        "后扰流尾翼（带LED 高位刹车灯） ": ["●", "●"]
    },
    "■内饰": {
        "木纹内饰": ["金属棕色木纹", "棕色橄榄灰木纹"],
        "豪华一体式中央储物箱（可双向开启、集成USB/AUX/VTR及电源接口）": ["●", "●"],
        "双环式LED自发光仪表盘": ["●", "●"],
        "4.2英寸彩色TFT多功能显示系统": ["●", "●"],
        "真皮木纹方向盘（带加热）&换挡杆": ["●", "●"],
        "集成控制式方向盘（可四向调节）": ["●", "●"],
        "16色智能LED环景照明系统": ["●", "●"],
        "第二排专属阅读灯": ["●", "●"],
        "后排豪华地毯及第二排专属豪华迎宾垫": ["●", "●"]
    },
    "■座椅": {
        "座椅材质": ["优质真皮+合成皮", "高级Nappa真皮+合成皮"],
        "前排座椅通风及加热": ["●", "●"],
        "驾驶席智能进入系统": ["●", "●"],
        "8向电动调节驾驶席": ["●", "●"],
        "4向电动调节带电动Ottoman副驾驶席（带电动腿托、后排电动调节功能）": ["●", "●"],
        "第二排电动Ottoman宽适旗舰座椅": ["-", "●"],
        "◆ 可伸缩电动腿托、可调节头枕、全倾倒功能": ["-", "●"],
        "◆ 座椅通风、加热及记忆功能": ["-", "●"],
        "◆ 独立手枕控制面板": ["-", "●"],
        "◆ 可收纳小桌板、独立杯架及手机、平板电脑、笔记本等储存空间": ["-", "●"],
        "第二排电动Ottoman头等舱座椅（带电动腿托，可调节头枕，全倾倒及加热功能）": ["●", "-"],
        "第三排座椅,可侧掀收折（带长距离滑移，全倾倒功能）": ["●", "●"]
    },
    "■安全": {
        "ABS防抱死制动系统（带EBD电子制动力分配系统,BA刹车辅助系统）": ["●", "●"],
        "ECB电子控制制动系统": ["●", "●"],
        "VDIM车辆动态综合管理系统": ["●", "●"],
        "S-VSC带转向辅助式车身稳定控制系统": ["●", "●"],
        "TRC牵引力控制系统": ["●", "●"],
        "HAC上坡启动辅助系统": ["●", "●"],
        "EPS电动助力转向系统": ["●", "●"],
        "EPB电子驻车系统": ["●", "●"],
        "BSM并线盲点监控系统": ["●", "●"],
        "RCTA倒车侧后方盲点警示系统": ["●", "●"],
        "TPMS胎压监测系统": ["●", "●"],
        "泊车雷达": ["●", "●"],
        "PVM全景监控系统": ["●", "●"],
        "FDM流媒体内后视镜": ["●", "●"],
        "前排座椅头部主动保护系统": ["●", "●"],
        "前排二级式SRS空气囊": ["●", "●"],
        "驾驶席膝部SRS空气囊": ["●", "●"],
        "前排侧SRS空气囊": ["●", "●"],
        "三排窗帘式SRS空气囊（保护前排,第二排,第三排乘客） ": ["●", "●"],
        "前排预紧3点式ELR安全带  ": ["●", "●"],
        "第二排3点式ELR安全带（带自动锁定装置）": ["●", "●"],
        "第三排3点式ELR安全带": ["●", "●"],
        "ISO儿童座椅固定装置(第二排座椅)": ["●", "●"],
        "发动机停机防盗系统": ["●", "●"]
    },
    "■Toyota  Safety Sense 智行安全": {
        "PCS预碰撞安全系统": ["●", "●"],
        "LDA车道偏离警示系统": ["●", "●"],
        "AHB自动调节远光灯系统": ["●", "●"],
        "DRCC动态雷达巡航控制系统": ["●", "●"],
        "LTA车道循迹辅助系统（带低速跟车行驶功能）": ["●", "●"]
    },
    "■舒适装备": {
        "大型双天窗（前：倾斜式 后：滑动式）": ["●", "●"],
        "三区独立控制空调系统（带花粉过滤功能）": ["●", "●"],
        "nanoe™（纳米水离子）空气净化系统": ["●", "●"],
        "智能防夹电动侧门及尾门系统": ["●", "●"],
        "智能钥匙，一键启动系统": ["●", "●"],
        "定速巡航系统": ["●", "●"],
        "侧窗遮阳帘（第二/三排）": ["●", "●"]
    },
    "■娱乐及电子导航系统": {
        "AM/FM/DVD/前排娱乐影音系统": ["●", "●"],
        "蓝光DVD后排娱乐影音系统（带12.1英寸WXGA液晶显示屏）": ["●", "●"],
        "JBL 高级音响系统（带17扬声器）": ["●", "●"],
        "AVN 导航系统（8英寸触控显示屏、带蓝牙免提功能）": ["●", "●"],
        "G-book智能副驾系统（手机版）": ["●", "●"],
        "HDMI/VTR多媒体接入端口": ["●", "●"]
    }
}

VEHICLE_ALPHA_MODEL = ["2.5L 双擎豪华版", "2.5L 双擎尊贵版"]

# // 广汽ix4
# // https://www.gac-toyota.com.cn/minisite/Campaigns/2018/ix4Table
# // https://www.gac-toyota.com.cn/minisite/campaigns/2018/ix4/models/js/hevmap.js

VEHICLE_GQIX4_CONFIG = {
    "": {
        "官方指导价": ["21.48万元", "22.48万元"]
    },

    "车身参数": {
        "长×宽×高 mm": ["4525×1852×1685", "4525×1852×1685"],
        "轴距 mm": ["2640", "2640"],
        "整车装备质量 kg": ["1735", "1771"],
        "前后悬挂系统": ["前：麦弗逊式独立悬挂 后：多连杆独立悬挂", "前：麦弗逊式独立悬挂 后：多连杆独立悬挂"],
        "前后制动系统": ["前：通风盘式 后：盘式", "前：通风盘式 后：盘式"],
        "转向系统": ["EPS电动助力转向系统", "EPS电动助力转向系统"],
        "动力电池类型": ["三元锂离子电池", "三元锂离子电池"]
    },
    "动力性能": {
        "电机类型": ["永磁同步电机", "永磁同步电机"],
        "驱动电机峰值功率/扭矩 kW/N·m": ["132/290", "132/290"],
        "0-50km/h加速时间 s": ["4.5", "4.5"],
        "1km最高车速 km/h": ["156", "156"],
        "工况百公里耗电量 kWh/100km": ["≤18.2", "≤18.2"],
        "纯电续航里程(NEDC工况)km / 60km/h等速续航里程km": ["270/376", "270/376"],
        "交流慢充时间": ["8小时充满(6.6kW)", "8小时充满(6.6kW)"],
        "直流快充时间": ["30分钟充至80%", "30分钟充至80%"]
    },
    "外观": {
        "电镀蓝前格栅": ["●", "●"],
        "透镜卤素前大灯(带高度手动调节/延时关闭/未关警示功能)": ["●", "━"],
        "矩阵式全LED前大灯(带高度手动调节/延时关闭/未关警示功能)": ["━", "●"],
        "L型LED日间行车灯": ["●", "●"],
        "LED前/后位置灯": ["●", "●"],
        "LED组合尾灯": ["●", "●"],
        "LED高位刹车灯": ["●", "●"],
        "后雾灯": ["●", "●"],
        "外后视镜电动调节": ["●", "●"],
        "驾驶席侧一键升降式防夹电动车窗+其余车窗一键降": ["●", "●"],
        "内藏式防夹电动天窗": ["━", "●"],
        "铝合金行李架": ["●", "●"],
        "鲨鱼鳍天线": ["●", "●"],
        "轮毂/轮胎": ["17英寸铝合金轮毂\n+215/60 R17轮胎", "18英寸铝合金轮毂\n+215/55 R18轮胎"],
        "T型备胎": ["●", "●"]
    },
    "内饰": {
        "数字组合仪表(3.5英寸彩色TFT屏)": ["●", "●"],
        "多功能方向盘": ["●", "●"],
        "驾驶席手动座椅6向调节": ["●", "●"],
        "副驾驶席手动座椅4向调节": ["●", "●"],
        "前排中央扶手": ["●", "●"],
        "后排座椅4/6分体折叠放倒": ["●", "●"],
        "后排折叠式中央扶手带杯架+后排中央头枕": ["●", "●"],
        "座椅材质": ["合成皮", "合成皮"]
    },
    "安全": {
        "ESP车辆电子稳定控制系统": ["●", "●"],
        "ABS制动防抱死系统": ["●", "●"],
        "EBD电子制动力分配系统": ["●", "●"],
        "EPB电子驻车制动系统(带Auto Hold自动驻车功能)": ["●", "●"],
        "HBA紧急制动辅助系统": ["●", "●"],
        "HHC上坡辅助控制系统": ["●", "●"],
        "HDC下坡辅助控制系统": ["●", "●"],
        "倒车影像": ["━", "●"],
        "倒车雷达(后）": ["━", "●"],
        "胎压监测": ["●", "●"],
        "GAC高强度安全车身设计": ["●", "●"],
        "驾驶员和乘员安全气囊": ["●", "●"],
        "侧气囊": ["●", "●"],
        "ISOFIX儿童安全座椅车身固定装置": ["●", "●"],
        "后排车门儿童安全门锁": ["●", "●"],
        "中控门锁(四门带内锁止拉索)": ["●", "●"],
        "冲击感应式车门自动开锁装置": ["●", "●"],
        "车速感应式车门自动上锁、熄火自动解锁装置": ["●", "●"]
    },
    "智能互联": {
        "高清全彩10.1英寸触控屏": ["●", "●"],
        "语音控制系统": ["●", "●"],
        "方言语音播报": ["●", "●"],
        "车载T-BOX": ["●", "●"]
    },
    "舒适及便捷装备": {
        "无匙启动/智能进入系统": ["●", "●"],
        "全自动空调": ["●", "●"],
        "后排空调出风口": ["●", "●"],
        "车内灯光延迟熄灭功能": ["●", "●"],
        "充电指示灯": ["●", "●"],
        "手动防眩目内后视镜": ["●", "●"],
        "6扬声器音响系统(音响音量随车速调节功能/支持MP3/WMA文件播放)": ["●", "●"],
        "前排USB接口/后排USB充电器": ["●", "●"],
        "定速巡航系统(带方向盘控制按键)": ["●", "●"],
        "ECO智能化绿色节能模式": ["●", "●"],
        "制动能量回收比例可调": ["●", "●"],
        "蓄电池(12V)低电量提醒 ": ["●", "●"],
        "行车提示音系统": ["●", "●"]
    }
}
VEHICLE_GQIX4_MODEL = ["领先版", "豪华版"]
